#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.deployment_apiary_starter_staging.github_branch.branch["development"] will be created
  + resource "github_branch" "branch" {
      + branch        = "development"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "deployment-apiary-starter-staging"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.deployment_apiary_starter_staging.github_branch.branch["staging"] will be created
  + resource "github_branch" "branch" {
      + branch        = "staging"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "deployment-apiary-starter-staging"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.deployment_apiary_starter_staging.github_branch_default.default[0] will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + rename     = false
      + repository = "deployment-apiary-starter-staging"
    }

  # module.deployment_apiary_starter_staging.github_branch_protection.wildcard will be created
  + resource "github_branch_protection" "wildcard" {
      + allows_deletions                = true
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.deployment_apiary_starter_staging.github_branch_protection_v3.main will be created
  + resource "github_branch_protection_v3" "main" {
      + branch                          = "main"
      + enforce_admins                  = true
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + repository                      = "deployment-apiary-starter-staging"
      + require_conversation_resolution = false
      + require_signed_commits          = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # module.deployment_apiary_starter_staging.github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Repo for the staging env running the starter edition"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = true
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "deployment-apiary-starter-staging"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true

      + template {
          + include_all_branches = false
          + owner                = "hivemq-cloud"
          + repository           = "sre-repo-template"
        }
    }

  # module.deployment_apiary_starter_staging.github_repository_collaborator.collaborator["patrickjahns"] will be created
  + resource "github_repository_collaborator" "collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "deployment-apiary-starter-staging"
      + username                    = "patrickjahns"
    }

  # module.deployment_apiary_starter_staging.github_team_repository.team_repository[0] will be created
  + resource "github_team_repository" "team_repository" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "deployment-apiary-starter-staging"
      + team_id    = "sre"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cfabriziohivemq, Action: `pull_request`*